задачник_едт/src/Documents/ПоступлениеДенег/ПоступлениеДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДенег</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПартнерами</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСИсполнителями</registerRecords>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПлатежа</name>
    <type>
      <types>CatalogRef.СпособПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>DocumentRef.ЭтапПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

задачник_едт/src/AccumulationRegisters/ВзаиморасчетыСКлиентами/ВзаиморасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаченная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроекта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

задачник_едт/src/AccumulationRegisters/ВзаиморасчетыСПартнерами/ВзаиморасчетыСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСПартнерами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроекта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

задачник_едт/src/Enums/ВидыРасчета/ВидыРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасчета</name>
  <enumValues>
    <name>СИсполнителями</name>
  </enumValues>
  <enumValues>
    <name>СПартнером</name>
  </enumValues>
  <enumValues>
    <name>СКлиентом</name>
  </enumValues>
</mdclass:Enum>

задачник_едт/src/Documents/ПоступлениеДенег/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПриИзменении(Элемент)
	ОбновитьНераспределеннуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНераспределеннуюСумму()
	НераспределеннаяСумма = Объект.Сумма - Объект.РасшифровкаПлатежа.Итог("Сумма");
	Элементы.НераспределеннаяСумма.Видимость = (НераспределеннаяСумма <> 0);
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ОбновитьНераспределеннуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровку(Команда)
	Если Объект.РасшифровкаПлатежа.Количество() Тогда
		ОписаниеЗавершения = Новый ОписаниеОповещения("ЗаполнитьРасшифровкуФрагмент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеЗавершения, "Строки будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьРасшифровкуНаСервере();
		ОбновитьНераспределеннуюСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровкуФрагмент(Ответ, Параметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗаполнитьРасшифровкуНаСервере();
	ОбновитьНераспределеннуюСумму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуНаСервере()
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Запрос = Новый Запрос;
	Если Объект.ВидРасчета = Перечисления.ВидыРасчета.СПартнером Тогда
		Запрос.Текст = ТекстЗапросаПоПартнерам();
	Иначе
		Запрос.Текст = ТекстЗапросаПоКлиентам();
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() И Объект.Сумма > Объект.РасшифровкаПлатежа.Итог("Сумма") Цикл
		НоваяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрокаРасшифровки.Этап = Выборка.Этап;
		НоваяСтрокаРасшифровки.Сумма = Мин(Объект.Сумма - Объект.РасшифровкаПлатежа.Итог("Сумма"), Выборка.Сумма)
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПоКлиентам()
	Возврат "ВЫБРАТЬ
		|	ВзаиморасчетыСКлиентамиОстатки.Этап КАК Этап,
		|	ВзаиморасчетыСКлиентамиОстатки.СуммаКОплатеОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКлиентами.Остатки КАК ВзаиморасчетыСКлиентамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСКлиентамиОстатки.Контрагент = &Контрагент";
КонецФункции

&НаСервере
Функция ТекстЗапросаПоПартнерам()
	Возврат "ВЫБРАТЬ
	|	ВзаиморасчетыСПартнерамиОстатки.Этап КАК Этап,
	|	ВзаиморасчетыСПартнерамиОстатки.СуммаКОплатеОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПартнерами.Остатки КАК ВзаиморасчетыСПартнерамиОстатки";
КонецФункции
